# Getting started with pandas

In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [3]:
%pwd

'C:\\Users\\student\\Documents\\jhfolder\\GitRepositories\\StudyML\\PythonforDA'

## Introduction to pandas data structures

### Series
일차원배열 (인덱스를 가짐 - 위치감 또는 레이블 가능)

In [4]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values?

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
list(obj2.index)

['d', 'b', 'a', 'c']

In [10]:
np.array(obj2.index)

array(['d', 'b', 'a', 'c'], dtype=object)

In [11]:
obj2['a']

-5

In [12]:
obj2['d'] = 6
obj2[['c', 'a', 'd']] # 부분집합

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [14]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

In [18]:
# dictinary 를 이용한 Serise 만들기 
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [19]:
# 별도의 index 사용 인덱스를 기준으로 데이터를 넣음 (충돌시 인덱스 우선)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [22]:
# 패키지와 같은 역할을 하는 함수가 존재
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
obj3 + obj4 # 인덱스가 같은 것끼리 연산 Null + 값 = Null

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [26]:
# 값에 대한 이름, 인덱스에 대한 이름 
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [27]:
# 인덱스 변경 
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

엑셀의 워크시트, table, 과 같은 자료구조

In [28]:
#dictianary 를 이용한 DF 
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [29]:
frame # 인덱스의 포지션과 레이블이 0, 1, 2, 3

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [30]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [31]:
# 사전에 없는 컬럼 값을 넣으면 NaN 으로 채워짐 
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [32]:
frame2.columns # . 속성을 우선함 (컬럼명이 columns 인경우 [''] 를 사용해야함)

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [33]:
frame2['state'] # 컬럼 레이블

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [34]:
type(frame2['state'])

pandas.core.series.Series

In [35]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [36]:
frame2.ix['three'] #위치값, 레이블 전부 받아들임 구버전 iloc, loc 사용

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [38]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [39]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [40]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [41]:
# arange 해당 순서로 값이 채워짐 
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [42]:
# series 를 이용 insert
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [43]:
# 오른쪽 : 수식 
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [44]:
# 컬럼 삭제 
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [45]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [46]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [47]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [48]:
# 인덱스 변경 
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [49]:
# 파이선의 슬라이싱으로 value 값 만들기 DF['컬럼명'][:-1]
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [50]:
# 메타데이터 의미 지정
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [51]:
frame3.values # values 를 numpy 의 이차원배열로 리턴

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [52]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index objects

In [53]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [54]:
index[1:]

Index(['b', 'c'], dtype='object')

In [55]:
index[1] = 'd' # mutable

TypeError: Index does not support mutable operations

In [56]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [57]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [58]:
'Ohio' in frame3.columns

True

In [59]:
2003 in frame3.index

False

## Essential functionality

### Reindexing

In [60]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [62]:
# 값의 순서 변경 또는 추가 가능 
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [66]:
obj2.a = -5.0
obj2

a   -5.0
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [63]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [67]:
# ffill : 비어있는 값을 이전 인덱스 값으로 채워라 
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [70]:
# index 를 그냥 주면 정렬되어서 들어가지만 colums 를 주면 준 순서대로 들어감
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [71]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [72]:
# 지정해준 인덱스만 들어감 
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [74]:
np.sort(states)

array(['California', 'Texas', 'Utah'],
      dtype='<U10')

In [73]:
# 
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
              columns=states)

ValueError: index must be monotonic increasing or decreasing

In [75]:
frame.ix[['a', 'b', 'c', 'd'], states] #row, columns

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping entries from an axis
축으로 값 삭제 하기

In [76]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [77]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [78]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [79]:
data.drop(['Colorado', 'Ohio']) # default axis = 0

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [81]:
data.drop('two', axis=1) # 컬럼 axis=1

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [80]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [82]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [83]:
obj[1]

1.0

In [84]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [85]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [86]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [87]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [88]:
# 레이블을 이용한 슬라이싱 (마지막 인덱스를 포함한다.!!)
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [89]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [90]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [92]:
# 컬럼 인덱싱 축의 기본값이 axis = 0
# Series 리턴
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [93]:
# DataFrame 리턴
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [94]:
# 숫자값이 들어가면 row position 기준 
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [95]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [96]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [97]:
data[data < 5] = 0

In [98]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [99]:
data.ix['Colorado', ['two', 'three']]

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int32

In [100]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [101]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [102]:
data.ix[ : 'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [103]:
data.ix[data.three > 5, :3] # 일부컬럼만 선택 :3

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

연산

In [104]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [105]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [106]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [107]:
s1 + s2 # 레이블 값으로 더함

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

ipython 에 값 프린트 모두 보이게 하기 <br>
설정은 별로의 셀에서 시행해야 적용됨

In [119]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all" #'last' 기본값

In [120]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1
df2

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [121]:
df1 + df2 # 없는 값은 nan 으로 채워짐

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [129]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1
df2

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [124]:
df1 + df2 # 자동으로 인덱스 재배치함

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [125]:
# df1 에 없는 값을 0 으로 채우고 더해라 
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [127]:
# 컬럼을 재 배치하고 값이 없으면 0 으로 채워라 
df1.reindex(columns=df2.columns, fill_value=0)
df1.reindex(columns=df2.columns)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

     a    b     c     d   e
0  0.0  1.0   2.0   3.0 NaN
1  4.0  5.0   6.0   7.0 NaN
2  8.0  9.0  10.0  11.0 NaN

In [131]:
df1.reindex(index=df2.index, columns=df2.columns, fill_value=0)

     a    b     c     d    e
0  0.0  1.0   2.0   3.0  0.0
1  4.0  5.0   6.0   7.0  0.0
2  8.0  9.0  10.0  11.0  0.0
3  0.0  0.0   0.0   0.0  0.0

#### Operations between DataFrame and Series

In [132]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [133]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [134]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [136]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0] #  frame.ioc['Utah']
series
frame

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [137]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [ ]:
series

In [138]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [140]:
series3 = frame['d'] # 컬럼 
series3
frame

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [ ]:
series3x

In [142]:
frame - series3 # 원하는 결과가 나오지 않는다. axis = 1 이 기본값 (특이함)

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [144]:
# column 을 기준으로 연산
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping

In [145]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [146]:
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [147]:
# 절대값 구함
np.abs(frame)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [148]:
f = lambda x: x.max() - x.min()

In [149]:
frame.apply(f) # 기본 axis = 0 이 됨 각컬럼 값 4개 중에 최대 최소

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [150]:
frame.apply(f, axis=1)

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [151]:
# 사용자 정의함수 적용하기
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [153]:
# 모든 원소에 대해서 전부 적용

format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [156]:
# 컬럼에 대해서 적용 
frame['e'].map(format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

### Sorting and ranking

In [157]:
# 인덱스를 정렬, 값이 변경되는 것은 아니다.
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [158]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [159]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [160]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [163]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [169]:
obj = Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [168]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
#obj.order()
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [164]:
# 값으로 정렬 
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [165]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [176]:
# 순위 매기기 동점인 경우 평균을 사용 예) 7이 2명이라서 6.5
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [177]:
# 동률인 경우 나오는 순선대로 우선함 (오름차순)
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [178]:
# 동률인 경우 큰 값을 우선으로함 
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [179]:
# DF Rank 
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [182]:
frame.rank(axis=0) # 가로로 채움 평균값 1.5등(1,2등 3/2) 3.5등 (3,4등 7/2)
frame.rank(axis=1) # 세로로 채움

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### Axis indexes with duplicate values

In [183]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [184]:
# index 값이 유일한지 확인
obj.index.is_unique # 중복된 값이 있음

False

In [185]:
obj['a']

a    0
a    1
dtype: int32

In [186]:
obj['c']

4

In [188]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df
df.index.is_unique

          0         1         2
a -0.577087  0.124121  0.302614
a  0.523772  0.000940  1.343810
b -0.713544 -0.831154 -2.370232
b -1.860761 -0.860757  0.560145

False

In [196]:
df.loc['b']
df.iloc[2:4]

          0         1         2
b -0.713544 -0.831154 -2.370232
b -1.860761 -0.860757  0.560145

          0         1         2
b -0.713544 -0.831154 -2.370232
b -1.860761 -0.860757  0.560145

## Summarizing and computing descriptive statistics

데이터의 특징 보기

In [197]:
# np.nan 사용 
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [198]:
# 컬럼의 모든 값을 다 더함 NaN 값은 제외 
df.sum()

one    9.25
two   -5.80
dtype: float64

In [199]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [200]:
# 널값 포함해서 구하기
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [201]:
# 값의 최대값에 해당하는 index 리턴 
df.idxmax()

one    b
two    d
dtype: object

In [203]:
# 누적합 구함 (컬럼)
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [204]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [205]:
# 값이 명목형일때 총개수, 유일값, 가장많이 등장한 값, 가장많이 등장한 값의 빈도수
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

상관계수, 공분산

상관계수 : -1~1 값 으로 정규화 시켜서 보여줌 <br>
공분산 : 두값의 상관관계를 보여줌

In [213]:
# web.get_data_yahoo 야후의 주식 데이터 가져오기 
# import pandas.io.data as web
from pandas_datareader import get_data_yahoo
# import pandas_datareader as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GG']:
    all_data[ticker] = get_data_yahoo(ticker)
all_data

{'AAPL':                   Open        High         Low       Close   Adj Close  \
 Date
 2010-01-04   30.490000   30.642857   30.340000   30.572857   27.505054
 2010-01-05   30.657143   30.798571   30.464285   30.625713   27.552608
 2010-01-06   30.625713   30.747143   30.107143   30.138571   27.114347
 2010-01-07   30.250000   30.285715   29.864286   30.082857   27.064222
 2010-01-08   30.042856   30.285715   29.865715   30.282858   27.244156
 2010-01-11   30.400000   30.428572   29.778572   30.015715   27.003820
 2010-01-12   29.884285   29.967142   29.488571   29.674286   26.696650
 2010-01-13   29.695715   30.132856   29.157143   30.092857   27.073221
 2010-01-14   30.015715   30.065714   29.860001   29.918571   26.916422
 2010-01-15   30.132856   30.228571   29.410000   29.418571   26.466595
 2010-01-19   29.761429   30.741428   29.605715   30.719999   27.637430
 2010-01-20   30.701429   30.792856   29.928572   30.247143   27.212029
 2010-01-21   30.297142   30.472857   29.601429   29.724285   26.741631
 2010-01-22   29.540001   29.642857   28.165714   28.250000   25.415281
 2010-01-25   28.930000   29.242857   28.598572   29.010000   26.099028
 2010-01-26   29.421429   30.530001   28.940001   29.420000   26.467880
 2010-01-27   29.549999   30.082857   28.504286   29.697144   26.717218
 2010-01-28   29.275715   29.357143   28.385714   28.469999   25.613209
 2010-01-29   28.725714   28.885714   27.178572   27.437143   24.683992
 2010-02-01   27.481428   28.000000   27.328571   27.818571   25.027143
 2010-02-02   27.987143   28.045713   27.625713   27.980000   25.172379
 2010-02-03   27.881428   28.600000   27.774286   28.461428   25.605494
 2010-02-04   28.104286   28.338572   27.367144   27.435715   24.682707
 2010-02-05   27.518572   28.000000   27.264286   27.922857   25.120964
 2010-02-08   27.955715   28.268572   27.714285   27.731428   24.948748
 2010-02-09   28.059999   28.214285   27.821428   28.027143   25.214790
 2010-02-10   27.984285   28.085714   27.751429   27.874287   25.077271
 2010-02-11   27.840000   28.535715   27.722857   28.381428   25.533520
 2010-02-12   28.301428   28.805714   27.928572   28.625713   25.753294
 2010-02-16   28.848572   29.098572   28.788572   29.057142   26.141434
 ...                ...         ...         ...         ...         ...
 2017-07-24  150.580002  152.440002  149.899994  152.089996  151.495071
 2017-07-25  151.800003  153.839996  151.800003  152.740005  152.142548
 2017-07-26  153.350006  153.929993  153.059998  153.460007  152.859726
 2017-07-27  153.750000  153.990005  147.300003  150.559998  149.971069
 2017-07-28  149.889999  150.229996  149.190002  149.500000  148.915207
 2017-07-31  149.899994  150.330002  148.130005  148.729996  148.148224
 2017-08-01  149.100006  150.220001  148.410004  150.050003  149.463058
 2017-08-02  159.279999  159.750000  156.160004  157.139999  156.525330
 2017-08-03  157.050003  157.210007  155.020004  155.570007  154.961472
 2017-08-04  156.070007  157.399994  155.690002  156.389999  155.778259
 2017-08-07  157.059998  158.919998  156.669998  158.809998  158.188797
 2017-08-08  158.600006  161.830002  158.270004  160.080002  159.453827
 2017-08-09  159.259995  161.270004  159.110001  161.059998  160.429993
 2017-08-10  159.899994  160.000000  154.630005  155.320007  155.320007
 2017-08-11  156.600006  158.570007  156.070007  157.479996  157.479996
 2017-08-14  159.320007  160.210007  158.750000  159.850006  159.850006
 2017-08-15  160.660004  162.199997  160.139999  161.600006  161.600006
 2017-08-16  161.940002  162.509995  160.149994  160.949997  160.949997
 2017-08-17  160.520004  160.710007  157.839996  157.860001  157.860001
 2017-08-18  157.860001  159.500000  156.720001  157.500000  157.500000
 2017-08-21  157.500000  157.889999  155.110001  157.210007  157.210007
 2017-08-22  158.229996  160.000000  158.020004  159.779999  159.779999
 2017-08-23  159.070007  160.470001  158.880005  159.979996  159.979996
 2017-08-24  160.429993  160.740005  158.550003  159.270004  159.270004
 2017-08-25  159.649994  160.559998  159.270004  159.860001  159.860001
 2017-08-28  160.139999  162.000000  159.929993  161.470001  161.470001
 2017-08-29  160.100006  163.119995  160.000000  162.910004  162.910004
 2017-08-30  163.800003  163.889999  162.610001  163.350006  163.350006
 2017-08-31  163.639999  164.520004  163.479996  164.000000  164.000000
 2017-09-01  164.800003  164.940002  163.630005  164.050003  164.050003

                Volume
 Date
 2010-01-04  123432400
 2010-01-05  150476200
 2010-01-06  138040000
 2010-01-07  119282800
 2010-01-08  111902700
 2010-01-11  115557400
 2010-01-12  148614900
 2010-01-13  151473000
 2010-01-14  108223500
 2010-01-15  148516900
 2010-01-19  182501900
 2010-01-20  153038200
 2010-01-21  152038600
 2010-01-22  220441900
 2010-01-25  266424900
 2010-01-26  466777500
 2010-01-27  430642100
 2010-01-28  293375600
 2010-01-29  311488100
 2010-02-01  187469100
 2010-02-02  174585600
 2010-02-03  153832000
 2010-02-04  189413000
 2010-02-05  212576700
 2010-02-08  119567700
 2010-02-09  158221700
 2010-02-10   92590400
 2010-02-11  137586400
 2010-02-12  163867200
 2010-02-16  135934400
 ...               ...
 2017-07-24   21493200
 2017-07-25   18853900
 2017-07-26   15781000
 2017-07-27   32476300
 2017-07-28   17213700
 2017-07-31   19845900
 2017-08-01   35368600
 2017-08-02   69936800
 2017-08-03   27097300
 2017-08-04   20559900
 2017-08-07   21870300
 2017-08-08   36205900
 2017-08-09   26131500
 2017-08-10   40804300
 2017-08-11   26257100
 2017-08-14   22028200
 2017-08-15   29465500
 2017-08-16   27671600
 2017-08-17   27940600
 2017-08-18   27428100
 2017-08-21   26368500
 2017-08-22   21604600
 2017-08-23   19399100
 2017-08-24   19818900
 2017-08-25   25480100
 2017-08-28   25966000
 2017-08-29   29516900
 2017-08-30   27269600
 2017-08-31   26785100
 2017-09-01   16552800

 [1931 rows x 6 columns],
 'GG':                  Open       High        Low      Close  Adj Close    Volume
 Date
 2010-01-04  40.889999  41.130001  40.450001  40.680000  36.422840   6570500
 2010-01-05  40.980000  41.549999  40.380001  41.220001  36.906334   7682900
 2010-01-06  41.630001  42.549999  41.529999  41.959999  37.568871   9120400
 2010-01-07  41.950001  41.980000  41.209999  41.840000  37.461441   5832400
 2010-01-08  42.009998  42.459999  41.419998  42.410000  37.971786   5944300
 2010-01-11  43.189999  43.549999  42.189999  42.450001  38.007595   6548800
 2010-01-12  41.950001  42.570000  40.790001  40.930000  36.659611   9330000
 2010-01-13  41.139999  41.490002  40.340000  41.169998  36.874584   7898300
 2010-01-14  41.330002  41.480000  40.340000  40.599998  36.364044   7455200
 2010-01-15  40.320000  40.320000  39.500000  39.650002  35.513172  10712500
 2010-01-19  39.619999  40.360001  39.599998  40.310001  36.104321   6843600
 2010-01-20  39.250000  39.790001  37.840000  38.160000  34.178623  15536400
 2010-01-21  38.070000  38.400002  36.910000  36.959999  33.103817  14384200
 2010-01-22  36.779999  37.900002  36.500000  36.930000  33.076962  12340000
 2010-01-25  37.410000  37.490002  36.209999  36.209999  32.432064  10067400
 2010-01-26  35.730000  36.990002  35.590000  36.340000  32.548504   8054000
 2010-01-27  36.360001  36.430000  35.270000  35.900002  32.154419  10387600
 2010-01-28  36.250000  36.459999  34.860001  35.680000  31.957380  10869200
 2010-01-29  35.639999  35.830002  33.889999  33.959999  30.416838  13424500
 2010-02-01  34.349998  35.610001  34.330002  35.540001  31.831987   8061800
 2010-02-02  36.000000  36.340000  35.439999  35.669998  31.948423   9966200
 2010-02-03  35.540001  36.169998  35.080002  35.160000  31.491642   7207200
 2010-02-04  34.490002  34.490002  33.080002  33.220001  29.754044  14658600
 2010-02-05  33.240002  35.580002  32.840000  35.509998  31.805090  18027000
 2010-02-08  35.480000  35.919998  34.320000  34.410000  30.819880  12511400
 2010-02-09  35.290001  36.500000  35.099998  35.889999  32.159489  14053700
 2010-02-10  35.869999  36.270000  35.099998  35.959999  32.222202   8741400
 2010-02-11  36.099998  37.520000  35.849998  37.439999  33.548367  10523400
 2010-02-12  36.709999  37.389999  36.380001  37.169998  33.306438   8320900
 2010-02-16  38.500000  38.799999  37.840000  38.330002  34.345856  10323000
 ...               ...        ...        ...        ...        ...       ...
 2017-07-24  13.700000  13.780000  13.420000  13.430000  13.430000   6955100
 2017-07-25  13.490000  13.620000  13.350000  13.420000  13.420000   7318500
 2017-07-26  13.370000  13.880000  13.350000  13.790000  13.790000  11945400
 2017-07-27  13.920000  13.940000  12.790000  12.810000  12.810000  20094100
 2017-07-28  12.950000  13.130000  12.880000  13.050000  13.050000   8514800
 2017-07-31  13.030000  13.280000  12.980000  13.130000  13.130000   9106000
 2017-08-01  13.090000  13.190000  12.880000  13.070000  13.070000   6787900
 2017-08-02  12.990000  13.100000  12.950000  12.960000  12.960000   5780500
 2017-08-03  12.950000  13.020000  12.780000  12.810000  12.810000   6331000
 2017-08-04  12.750000  12.770000  12.460000  12.560000  12.560000   8834400
 2017-08-07  12.680000  12.740000  12.520000  12.560000  12.560000   4636500
 2017-08-08  12.750000  12.780000  12.490000  12.550000  12.550000   7262700
 2017-08-09  12.770000  12.800000  12.600000  12.720000  12.720000   9055100
 2017-08-10  12.960000  13.040000  12.780000  13.030000  13.030000   9149800
 2017-08-11  13.100000  13.150000  12.880000  13.000000  13.000000   7464600
 2017-08-14  12.870000  12.900000  12.720000  12.830000  12.830000   4664600
 2017-08-15  12.630000  12.750000  12.610000  12.730000  12.730000   4377900
 2017-08-16  12.740000  13.120000  12.690000  13.030000  13.030000   7515500
 2017-08-17  13.130000  13.190000  13.030000  13.170000  13.170000   6979700
 2017-08-18  13.380000  13.390000  12.850000  12.870000  12.870000   8731800
 2017-08-21  12.910000  13.040000  12.880000  13.010000  13.010000   6321400
 2017-08-22  12.980000  13.030000  12.900000  12.910000  12.910000   4771600
 2017-08-23  13.000000  13.030000  12.870000  13.020000  13.020000   3914700
 2017-08-24  13.000000  13.090000  12.960000  13.010000  13.010000   3616300
 2017-08-25  13.040000  13.210000  12.970000  13.070000  13.070000   4844800
 2017-08-28  13.230000  13.500000  13.110000  13.490000  13.490000   8437700
 2017-08-29  13.790000  13.790000  13.480000  13.590000  13.590000   8842600
 2017-08-30  13.530000  13.560000  13.320000  13.380000  13.380000   4966600
 2017-08-31  13.440000  13.780000  13.350000  13.750000  13.750000   8198000
 2017-09-01  13.820000  13.820000  13.620000  13.750000  13.750000   4825400

 [1931 rows x 6 columns],
 'IBM':                   Open        High         Low       Close   Adj Close  \
 Date
 2010-01-04  131.179993  132.970001  130.850006  132.449997  109.173752
 2010-01-05  131.679993  131.850006  130.100006  130.850006  107.854950
 2010-01-06  130.679993  131.490005  129.809998  130.000000  107.154320
 2010-01-07  129.869995  130.250000  128.910004  129.550003  106.783417
 2010-01-08  129.070007  130.919998  129.050003  130.850006  107.854950
 2010-01-11  131.059998  131.059998  128.669998  129.479996  106.725700
 2010-01-12  129.029999  131.330002  129.000000  130.509995  107.574692
 2010-01-13  130.389999  131.119995  129.160004  130.229996  107.343887
 2010-01-14  130.550003  132.710007  129.910004  132.309998  109.058350
 2010-01-15  132.029999  132.889999  131.089996  131.779999  108.621490
 2010-01-19  131.630005  134.250000  131.559998  134.139999  110.566757
 2010-01-20  130.460007  131.149994  128.949997  130.250000  107.360382
 2010-01-21  130.470001  130.690002  128.059998  129.000000  106.330040
 2010-01-22  128.669998  128.889999  125.370003  125.500000  103.445122
 2010-01-25  126.330002  126.889999  125.709999  126.120003  103.956169
 2010-01-26  125.919998  127.750000  125.410004  125.750000  103.651207
 2010-01-27  125.820000  126.959999  125.040001  126.330002  104.129272
 2010-01-28  127.029999  127.040001  123.050003  123.750000  102.002670
 2010-01-29  124.320000  125.000000  121.900002  122.389999  100.881660
 2010-02-01  123.230003  124.949997  122.779999  124.669998  102.760971
 2010-02-02  124.790001  125.809998  123.949997  125.529999  103.469849
 2010-02-03  125.160004  126.070000  125.070000  125.660004  103.577019
 2010-02-04  125.190002  125.440002  122.900002  123.000000  101.384453
 2010-02-05  123.040001  123.720001  121.830002  123.519997  101.813095
 2010-02-08  123.150002  123.220001  121.739998  121.879997  100.910622
 2010-02-09  122.650002  124.199997  122.459999  123.209999  102.011803
 2010-02-10  122.940002  123.650002  122.209999  122.809998  101.680611
 2010-02-11  122.580002  124.199997  122.059998  123.730003  102.442314
 2010-02-12  123.010002  124.050003  121.610001  124.000000  102.665886
 2010-02-16  124.910004  125.230003  124.110001  125.230003  103.684265
 ...                ...         ...         ...         ...         ...
 2017-07-24  147.000000  147.039993  145.800003  145.990005  144.463654
 2017-07-25  146.570007  147.490005  146.029999  146.190002  144.661560
 2017-07-26  146.270004  146.460007  144.470001  145.360001  143.840240
 2017-07-27  145.000000  145.399994  143.639999  145.070007  143.553284
 2017-07-28  144.809998  145.039993  143.839996  144.289993  142.781418
 2017-07-31  144.380005  144.929993  144.169998  144.669998  143.157455
 2017-08-01  145.000000  145.669998  144.720001  145.300003  143.780869
 2017-08-02  145.119995  145.289993  144.220001  144.449997  142.939758
 2017-08-03  144.429993  145.339996  144.429993  144.940002  143.424637
 2017-08-04  145.000000  145.389999  144.399994  145.160004  143.642334
 2017-08-07  145.000000  145.089996  142.750000  143.470001  141.970001
 2017-08-08  142.000000  142.759995  142.000000  142.110001  142.110001
 2017-08-09  141.750000  142.029999  141.190002  141.770004  141.770004
 2017-08-10  141.639999  142.419998  141.229996  141.839996  141.839996
 2017-08-11  142.449997  142.589996  141.520004  141.839996  141.839996
 2017-08-14  142.000000  142.759995  141.940002  142.320007  142.320007
 2017-08-15  142.550003  143.339996  140.580002  142.070007  142.070007
 2017-08-16  141.789993  142.910004  141.610001  142.500000  142.500000
 2017-08-17  142.520004  142.889999  140.699997  140.699997  140.699997
 2017-08-18  140.869995  141.149994  139.580002  139.699997  139.699997
 2017-08-21  139.589996  140.419998  139.130005  140.330002  140.330002
 2017-08-22  140.639999  141.149994  140.380005  141.009995  141.009995
 2017-08-23  140.699997  143.050003  140.679993  142.139999  142.139999
 2017-08-24  142.500000  143.679993  142.250000  142.940002  142.940002
 2017-08-25  143.300003  144.190002  143.250000  143.740005  143.740005
 2017-08-28  144.110001  144.559998  142.389999  142.509995  142.509995
 2017-08-29  142.100006  143.429993  141.899994  143.139999  143.139999
 2017-08-30  143.259995  143.279999  142.410004  142.559998  142.559998
 2017-08-31  143.020004  143.660004  142.630005  143.029999  143.029999
 2017-09-01  142.979996  144.500000  142.979996  144.080002  144.080002

               Volume
 Date
 2010-01-04   6155300
 2010-01-05   6841400
 2010-01-06   5605300
 2010-01-07   5840600
 2010-01-08   4197200
 2010-01-11   5730400
 2010-01-12   8081500
 2010-01-13   6455400
 2010-01-14   7111800
 2010-01-15   8494400
 2010-01-19  13916200
 2010-01-20  15197500
 2010-01-21   9608600
 2010-01-22  10088600
 2010-01-25   5738500
 2010-01-26   7135300
 2010-01-27   8719200
 2010-01-28   9622200
 2010-01-29  11571200
 2010-02-01   7242900
 2010-02-02   5899900
 2010-02-03   4177100
 2010-02-04   9126900
 2010-02-05   8617000
 2010-02-08   5718500
 2010-02-09   6044500
 2010-02-10   5219100
 2010-02-11   5089000
 2010-02-12   8017700
 2010-02-16   6777300
 ...              ...
 2017-07-24   3877600
 2017-07-25   4208900
 2017-07-26   3932400
 2017-07-27   6430800
 2017-07-28   3054800
 2017-07-31   4355700
 2017-08-01   3219500
 2017-08-02   3540900
 2017-08-03   3035400
 2017-08-04   2549400
 2017-08-07   4618300
 2017-08-08   3298700
 2017-08-09   2925800
 2017-08-10   4525400
 2017-08-11   3004000
 2017-08-14   2222300
 2017-08-15   4681500
 2017-08-16   3287800
 2017-08-17   4422100
 2017-08-18   4152700
 2017-08-21   3190700
 2017-08-22   2544400
 2017-08-23   4048300
 2017-08-24   3592200
 2017-08-25   2872900
 2017-08-28   5134500
 2017-08-29   3009500
 2017-08-30   2736000
 2017-08-31   3656400
 2017-09-01   3348500

 [1931 rows x 6 columns],
 'MSFT':                  Open       High        Low      Close  Adj Close     Volume
 Date
 2010-01-04  30.620001  31.100000  30.590000  30.950001  25.275177   38409100
 2010-01-05  30.850000  31.100000  30.639999  30.959999  25.283342   49749600
 2010-01-06  30.879999  31.080000  30.520000  30.770000  25.128178   58182400
 2010-01-07  30.629999  30.700001  30.190001  30.450001  24.866852   50559700
 2010-01-08  30.280001  30.879999  30.240000  30.660000  25.038349   51197400
 2010-01-11  30.709999  30.760000  30.120001  30.270000  24.719858   68754700
 2010-01-12  30.150000  30.400000  29.910000  30.070000  24.556530   65912100
 2010-01-13  30.260000  30.520000  30.010000  30.350000  24.785191   51863500
 2010-01-14  30.309999  31.100000  30.260000  30.959999  25.283342   63228100
 2010-01-15  31.080000  31.240000  30.709999  30.860001  25.201679   79913200
 2010-01-19  30.750000  31.240000  30.680000  31.100000  25.397671   46575700
 2010-01-20  30.809999  30.940001  30.309999  30.590000  24.981182   54849500
 2010-01-21  30.610001  30.719999  30.000000  30.010000  24.507528   73086700
 2010-01-22  30.000000  30.200001  28.840000  28.959999  23.650047  102004600
 2010-01-25  29.240000  29.660000  29.100000  29.320000  23.944042   63373000
 2010-01-26  29.200001  29.850000  29.090000  29.500000  24.091042   66639900
 2010-01-27  29.350000  29.820000  29.020000  29.670000  24.229874   63949500
 2010-01-28  29.840000  29.870001  28.889999  29.160000  23.813379  117513700
 2010-01-29  29.900000  29.920000  27.660000  28.180000  23.013071  193888500
 2010-02-01  28.389999  28.480000  27.920000  28.410000  23.200891   85931100
 2010-02-02  28.370001  28.500000  28.139999  28.459999  23.241730   54413700
 2010-02-03  28.260000  28.790001  28.120001  28.629999  23.380560   61397900
 2010-02-04  28.379999  28.500000  27.809999  27.840000  22.735409   77850000
 2010-02-05  28.000000  28.280001  27.570000  28.020000  22.882408   80960100
 2010-02-08  28.010000  28.080000  27.570000  27.719999  22.637409   52820600
 2010-02-09  27.969999  28.340000  27.750000  28.010000  22.874241   59195800
 2010-02-10  28.030001  28.240000  27.840000  27.990000  22.857906   48591300
 2010-02-11  27.930000  28.400000  27.700001  28.120001  22.964071   65993700
 2010-02-12  27.809999  28.059999  27.580000  27.930000  22.808908   81117200
 2010-02-16  28.129999  28.370001  28.020000  28.350000  23.260166   51935600
 ...               ...        ...        ...        ...        ...        ...
 2017-07-24  73.529999  73.750000  73.129997  73.599998  73.209946   21394800
 2017-07-25  73.800003  74.309998  73.500000  74.190002  73.796822   22018700
 2017-07-26  74.339996  74.379997  73.809998  74.050003  73.657562   16252200
 2017-07-27  73.760002  74.419998  72.320000  73.160004  72.772285   36844200
 2017-07-28  72.669998  73.309998  72.540001  73.040001  72.652916   18306700
 2017-07-31  73.300003  73.440002  72.410004  72.699997  72.314713   23600100
 2017-08-01  73.099998  73.419998  72.489998  72.580002  72.195358   22132300
 2017-08-02  72.550003  72.559998  71.440002  72.260002  71.877052   26499200
 2017-08-03  72.190002  72.440002  71.849998  72.150002  71.767632   18214400
 2017-08-04  72.400002  73.040001  72.239998  72.680000  72.294823   22579000
 2017-08-07  72.800003  72.900002  72.260002  72.400002  72.016312   18705700

In [218]:
price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.items()})
price
volume

                  AAPL         GG         IBM       MSFT
Date
2010-01-04   27.505054  36.422840  109.173752  25.275177
2010-01-05   27.552608  36.906334  107.854950  25.283342
2010-01-06   27.114347  37.568871  107.154320  25.128178
2010-01-07   27.064222  37.461441  106.783417  24.866852
2010-01-08   27.244156  37.971786  107.854950  25.038349
2010-01-11   27.003820  38.007595  106.725700  24.719858
2010-01-12   26.696650  36.659611  107.574692  24.556530
2010-01-13   27.073221  36.874584  107.343887  24.785191
2010-01-14   26.916422  36.364044  109.058350  25.283342
2010-01-15   26.466595  35.513172  108.621490  25.201679
2010-01-19   27.637430  36.104321  110.566757  25.397671
2010-01-20   27.212029  34.178623  107.360382  24.981182
2010-01-21   26.741631  33.103817  106.330040  24.507528
2010-01-22   25.415281  33.076962  103.445122  23.650047
2010-01-25   26.099028  32.432064  103.956169  23.944042
2010-01-26   26.467880  32.548504  103.651207  24.091042
2010-01-27   26.717218  32.154419  104.129272  24.229874
2010-01-28   25.613209  31.957380  102.002670  23.813379
2010-01-29   24.683992  30.416838  100.881660  23.013071
2010-02-01   25.027143  31.831987  102.760971  23.200891
2010-02-02   25.172379  31.948423  103.469849  23.241730
2010-02-03   25.605494  31.491642  103.577019  23.380560
2010-02-04   24.682707  29.754044  101.384453  22.735409
2010-02-05   25.120964  31.805090  101.813095  22.882408
2010-02-08   24.948748  30.819880  100.910622  22.637409
2010-02-09   25.214790  32.159489  102.011803  22.874241
2010-02-10   25.077271  32.222202  101.680611  22.857906
2010-02-11   25.533520  33.548367  102.442314  22.964071
2010-02-12   25.753294  33.306438  102.665886  22.808908
2010-02-16   26.141434  34.345856  103.684265  23.260166
...                ...        ...         ...        ...
2017-07-24  151.495071  13.430000  144.463654  73.209946
2017-07-25  152.142548  13.420000  144.661560  73.796822
2017-07-26  152.859726  13.790000  143.840240  73.657562
2017-07-27  149.971069  12.810000  143.553284  72.772285
2017-07-28  148.915207  13.050000  142.781418  72.652916
2017-07-31  148.148224  13.130000  143.157455  72.314713
2017-08-01  149.463058  13.070000  143.780869  72.195358
2017-08-02  156.525330  12.960000  142.939758  71.877052
2017-08-03  154.961472  12.810000  143.424637  71.767632
2017-08-04  155.778259  12.560000  143.642334  72.294823
2017-08-07  158.188797  12.560000  141.970001  72.016312
2017-08-08  159.453827  12.550000  142.110001  72.404243
2017-08-09  160.429993  12.720000  141.770004  72.085938
2017-08-10  155.320007  13.030000  141.839996  71.031555
2017-08-11  157.479996  13.000000  141.839996  72.115776
2017-08-14  159.850006  12.830000  142.320007  73.199997
2017-08-15  161.600006  12.730000  142.070007  73.220001
2017-08-16  160.949997  13.030000  142.500000  73.650002
2017-08-17  157.860001  13.170000  140.699997  72.400002
2017-08-18  157.500000  12.870000  139.699997  72.489998
2017-08-21  157.210007  13.010000  140.330002  72.150002
2017-08-22  159.779999  12.910000  141.009995  73.160004
2017-08-23  159.979996  13.020000  142.139999  72.720001
2017-08-24  159.270004  13.010000  142.940002  72.690002
2017-08-25  159.860001  13.070000  143.740005  72.820000
2017-08-28  161.470001  13.490000  142.509995  72.830002
2017-08-29  162.910004  13.590000  143.139999  73.050003
2017-08-30  163.350006  13.380000  142.559998  74.010002
2017-08-31  164.000000  13.750000  143.029999  74.769997
2017-09-01  164.050003  13.750000  144.080002  73.940002

[1931 rows x 4 columns]

                 AAPL        GG       IBM       MSFT
Date
2010-01-04  123432400   6570500   6155300   38409100
2010-01-05  150476200   7682900   6841400   49749600
2010-01-06  138040000   9120400   5605300   58182400
2010-01-07  119282800   5832400   5840600   50559700
2010-01-08  111902700   5944300   4197200   51197400
2010-01-11  115557400   6548800   5730400   68754700
2010-01-12  148614900   9330000   8081500   65912100
2010-01-13  151473000   7898300   6455400   51863500
2010-01-14  108223500   7455200   7111800   63228100
2010-01-15  148516900  10712500   8494400   79913200
2010-01-19  182501900   6843600  13916200   46575700
2010-01-20  153038200  15536400  15197500   54849500
2010-01-21  152038600  14384200   9608600   73086700
2010-01-22  220441900  12340000  10088600  102004600
2010-01-25  266424900  10067400   5738500   63373000
2010-01-26  466777500   8054000   7135300   66639900
2010-01-27  430642100  10387600   8719200   63949500
2010-01-28  293375600  10869200   9622200  117513700
2010-01-29  311488100  13424500  11571200  193888500
2010-02-01  187469100   8061800   7242900   85931100
2010-02-02  174585600   9966200   5899900   54413700
2010-02-03  153832000   7207200   4177100   61397900
2010-02-04  189413000  14658600   9126900   77850000
2010-02-05  212576700  18027000   8617000   80960100
2010-02-08  119567700  12511400   5718500   52820600
2010-02-09  158221700  14053700   6044500   59195800
2010-02-10   92590400   8741400   5219100   48591300
2010-02-11  137586400  10523400   5089000   65993700
2010-02-12  163867200   8320900   8017700   81117200
2010-02-16  135934400  10323000   6777300   51935600
...               ...       ...       ...        ...
2017-07-24   21493200   6955100   3877600   21394800
2017-07-25   18853900   7318500   4208900   22018700
2017-07-26   15781000  11945400   3932400   16252200
2017-07-27   32476300  20094100   6430800   36844200
2017-07-28   17213700   8514800   3054800   18306700
2017-07-31   19845900   9106000   4355700   23600100
2017-08-01   35368600   6787900   3219500   22132300
2017-08-02   69936800   5780500   3540900   26499200
2017-08-03   27097300   6331000   3035400   18214400
2017-08-04   20559900   8834400   2549400   22579000
2017-08-07   21870300   4636500   4618300   18705700
2017-08-08   36205900   7262700   3298700   22044600
2017-08-09   26131500   9055100   2925800   22213400
2017-08-10   40804300   9149800   4525400   24734500
2017-08-11   26257100   7464600   3004000   21443700
2017-08-14   22028200   4664600   2222300   20067300
2017-08-15   29465500   4377900   4681500   19181400
2017-08-16   27671600   7515500   3287800   18150400
2017-08-17   27940600   6979700   4422100   22977500
2017-08-18   27428100   8731800   4152700   18761500
2017-08-21   26368500   6321400   3190700   17734800
2017-08-22   21604600   4771600   2544400   14343700
2017-08-23   19399100   3914700   4048300   13766500
2017-08-24   19818900   3616300   3592200   17098300
2017-08-25   25480100   4844800   2872900   12794300
2017-08-28   25966000   8437700   5134500   14569700
2017-08-29   29516900   8842600   3009500   11478400
2017-08-30   27269600   4966600   2736000   16897800
2017-08-31   26785100   8198000   3656400   27652800
2017-09-01   16552800   4825400   3348500   21706200

[1931 rows x 4 columns]

In [219]:
returns = price.pct_change()
returns.tail()

                AAPL        GG       IBM      MSFT
Date
2017-08-28  0.010071  0.032135 -0.008557  0.000137
2017-08-29  0.008918  0.007413  0.004421  0.003021
2017-08-30  0.002701 -0.015453 -0.004052  0.013142
2017-08-31  0.003979  0.027653  0.003297  0.010269
2017-09-01  0.000305  0.000000  0.007341 -0.011101

In [220]:
returns.MSFT.corr(returns.IBM)

0.48300904568365061

In [221]:
returns.MSFT.cov(returns.IBM)

8.0518452845229066e-05

In [222]:
returns.corr()

          AAPL        GG       IBM      MSFT
AAPL  1.000000  0.119241  0.367990  0.394345
GG    0.119241  1.000000  0.122215  0.108370
IBM   0.367990  0.122215  1.000000  0.483009
MSFT  0.394345  0.108370  0.483009  1.000000

In [223]:
returns.cov()

          AAPL        GG       IBM      MSFT
AAPL  0.000259  0.000049  0.000070  0.000090
GG    0.000049  0.000663  0.000037  0.000039
IBM   0.000070  0.000037  0.000139  0.000081
MSFT  0.000090  0.000039  0.000081  0.000200

In [224]:
# 특정 값을 정해서 상관도를 봄 
returns.corrwith(returns.IBM)

AAPL    0.367990
GG      0.122215
IBM     1.000000
MSFT    0.483009
dtype: float64

In [225]:
returns.corrwith(volume)

AAPL   -0.072689
GG     -0.036458
IBM    -0.210648
MSFT   -0.090433
dtype: float64

### Unique values, value counts, and membership

In [226]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [227]:
# 유일값
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [228]:
# 도수를 구함 값으로 정렬되어 나옴 
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [229]:
# 값이 나오는 순서대로 
pd.value_counts(obj.values, sort=False)

d    1
b    2
a    3
c    3
dtype: int64

In [230]:
# 값의 존재 확인하기 (mask 를 씌워서 원한느 값만 봄)
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [231]:
obj[mask] # 값만 골라내기

0    c
5    b
6    b
7    c
8    c
dtype: object

In [232]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [233]:
# pd.value_counts 값은 여러개의 값이여야 함 serise, list, ... 
result = data.apply(pd.value_counts).fillna(0) # 열 기준 
result # 값 | 컬럼개수

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling missing data

In [234]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [235]:
string_data.isnull() # Null 값이 아닌것

0    False
1    False
2     True
3    False
dtype: bool

In [236]:
# None 타입 == Null 
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [238]:
from numpy import nan as NA # 별칭 사용 
data = Series([1, NA, 3.5, NA, 7])
data.dropna() # NA 값 삭제 
data

0    1.0
2    3.5
4    7.0
dtype: float64

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [241]:
data[data.notnull()] # data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [244]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna() # na 값이 이면 전체 row 삭제 
data
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0

In [245]:
data.dropna(how='all') # 모든 요소가 na 일떄에만 drop

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [246]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [247]:
data.dropna(axis=1, how='all') # axis=1 column 삭제

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [249]:
df = DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.022185       NaN       NaN
1  0.862580       NaN       NaN
2  0.670216       NaN -0.955869
3 -0.023493       NaN -0.652469
4 -1.218302 -1.332610  1.074623
5  0.723642  0.690002  1.001543
6 -0.503087 -0.622274 -0.921169

In [251]:
# thresh 임계치를 지정 널 값이 3개 이하면 다 지워짐 
df.dropna(thresh=3)

          0         1         2
4 -1.218302 -1.332610  1.074623
5  0.723642  0.690002  1.001543
6 -0.503087 -0.622274 -0.921169

### Filling in missing data

In [252]:
df.fillna(0) # 데이터에 영향을 주지 않는다.

          0         1         2
0  0.022185  0.000000  0.000000
1  0.862580  0.000000  0.000000
2  0.670216  0.000000 -0.955869
3 -0.023493  0.000000 -0.652469
4 -1.218302 -1.332610  1.074623
5  0.723642  0.690002  1.001543
6 -0.503087 -0.622274 -0.921169

In [254]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.022185  0.000000  0.000000
1  0.862580  0.000000  0.000000
2  0.670216  0.000000 -0.955869
3 -0.023493  0.000000 -0.652469
4 -1.218302 -1.332610  1.074623
5  0.723642  0.690002  1.001543
6 -0.503087 -0.622274 -0.921169

In [255]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True) # 데이터에 실제로 값을 적용
df

          0         1         2
0  0.022185  0.000000  0.000000
1  0.862580  0.000000  0.000000
2  0.670216  0.000000 -0.955869
3 -0.023493  0.000000 -0.652469
4 -1.218302 -1.332610  1.074623
5  0.723642  0.690002  1.001543
6 -0.503087 -0.622274 -0.921169

In [257]:
df = DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA; 
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.118110 -0.748532  0.584970
1  0.152677 -1.565657 -0.562540
2 -0.032664       NaN -0.482573
3 -0.036264       NaN  0.980928
4 -0.589488       NaN       NaN
5  0.457002       NaN       NaN

In [258]:
df.fillna(method='ffill')

          0         1         2
0  0.118110 -0.748532  0.584970
1  0.152677 -1.565657 -0.562540
2 -0.032664 -1.565657 -0.482573
3 -0.036264 -1.565657  0.980928
4 -0.589488 -1.565657  0.980928
5  0.457002 -1.565657  0.980928

In [259]:
df.fillna(method='ffill', limit=2) # 두개 이상되면 채우지 마라

          0         1         2
0  0.118110 -0.748532  0.584970
1  0.152677 -1.565657 -0.562540
2 -0.032664 -1.565657 -0.482573
3 -0.036264 -1.565657  0.980928
4 -0.589488       NaN  0.980928
5  0.457002       NaN  0.980928

In [261]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean()) 
data

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [263]:
df.fillna(df.mean()) # column 의 평균치를 구해서 적용

          0         1         2
0  0.118110 -0.748532  0.584970
1  0.152677 -1.565657 -0.562540
2 -0.032664 -1.157094 -0.482573
3 -0.036264 -1.157094  0.980928
4 -0.589488 -1.157094  0.130196
5  0.457002 -1.157094  0.130196

## Hierarchical indexing
계층 인덱싱

In [264]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -1.022487
   2   -0.402827
   3    0.220487
b  1   -0.193401
   2    0.669158
   3   -1.648985
c  1   -2.252797
   2   -1.166832
d  2    0.353607
   3    0.702110
dtype: float64

In [265]:
# MultiIndex 클래스
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [266]:
data['b'] # Serise 값 return

1   -0.193401
2    0.669158
3   -1.648985
dtype: float64

In [269]:
data['b':'c'] # label 값

b  1   -0.193401
   2    0.669158
   3   -1.648985
c  1   -2.252797
   2   -1.166832
dtype: float64

In [270]:
data.loc[['b', 'd']]

b  1   -0.193401
   2    0.669158
   3   -1.648985
d  2    0.353607
   3    0.702110
dtype: float64

In [272]:
data[:, 2] # 상위 인덱스 , 하위 인덱스 (2 레이블)

a   -0.402827
b    0.669158
c   -1.166832
d    0.353607
dtype: float64

In [273]:
# 세로로 되어 있는 데이터를 가로로 보냄 (하위 인덱스가 컬럼이 됨)
data.unstack()

          1         2         3
a -1.022487 -0.402827  0.220487
b -0.193401  0.669158 -1.648985
c -2.252797 -1.166832       NaN
d       NaN  0.353607  0.702110

In [274]:
data.unstack().stack()

a  1   -1.022487
   2   -0.402827
   3    0.220487
b  1   -0.193401
   2    0.669158
   3   -1.648985
c  1   -2.252797
   2   -1.166832
d  2    0.353607
   3    0.702110
dtype: float64

In [280]:
data.unstack(level=0) # index 의 level 0 가 컬럼이 됨 -1이 기본 값 (마지막 레벨)

          a         b         c         d
1 -1.022487 -0.193401 -2.252797       NaN
2 -0.402827  0.669158 -1.166832  0.353607
3  0.220487 -1.648985       NaN  0.702110

In [275]:
s = Series([3,8,2,0,3,5], index=list('abcdef'))
s

a    3
b    8
c    2
d    0
e    3
f    5
dtype: int64

In [277]:
s.stack() # 인덱스가 하나인 경우 불가능함

AttributeError: 'Series' object has no attribute 'stack'

In [281]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [282]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [283]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

### Reordering and sorting levels

In [285]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [287]:
#frame.sortlevel(1)
frame.sort_index(1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [288]:
# frame.swaplevel(0, 1).sortlevel(0)
frame.swaplevel(0, 1).sort_index(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11


### Summary statistics by level

In [289]:
frame
frame.sum(level='key2')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [290]:
frame.sum(level='color', axis=1) # 모든 state

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns

In [291]:
# dictionary 를 이용
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [293]:
# 컬럼 두개를 인덱스로 하는 df 
frame2 = frame.set_index(['c', 'd'])
frame2
type(frame2)

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

pandas.core.frame.DataFrame

In [295]:
# 컬럼을 인덱스로 사용하고 다른 값들도 유지함
frame.set_index(['c', 'd'], drop=False)
frame # 원래 값은 유지

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [296]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas topics

### Integer indexing

In [297]:
ser = Series(np.arange(3.))
ser.iloc[-1]

2.0

In [298]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [299]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [304]:
ser.iloc[:1]
ser.loc[:1] # 레이블 값
ser[:1]

0    0.0
dtype: float64

0    0.0
1    1.0
dtype: float64

0    0.0
dtype: float64

In [307]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3
ser3.iloc[2]
ser3.loc[-5]

-5    0
 1    1
 3    2
dtype: int32

2

0

In [309]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame 
frame.iloc[0] # 2 0 1 index row 에 관한 값

   0  1
2  0  1
0  2  3
1  4  5

0    0
1    1
Name: 2, dtype: int32

### Panel data

3차원 데이터, 데이터프레임이 여러개 있는 것

In [321]:
# import pandas.io.data as web
import pandas_datareader as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk)) # stk 주식 정보 
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'IBM']))

# 2 차원 데이터가 쌓임 
# [] list compression
# () 제너레이터

In [322]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1931 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2017-09-01 00:00:00
Minor_axis axis: Open to Volume

In [326]:
pdata = pdata.swapaxes('items', 'minor') # 축을 바꿈 2 <-> 3 축 을 바꿈 
pdata

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  """Entry point for launching an IPython kernel.

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1931 (major_axis) x 4 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2010-01-04 00:00:00 to 2017-09-01 00:00:00
Minor_axis axis: AAPL to MSFT

In [327]:
pdata['Adj Close'] # 수정 종가 폐장 할때 다른값까지 고려해서 나온 값

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.505054  312.204773  109.173752  25.275177
2010-01-05   27.552608  310.829926  107.854950  25.283342
2010-01-06   27.114347  302.994293  107.154320  25.128178
2010-01-07   27.064222  295.940735  106.783417  24.866852
2010-01-08   27.244156  299.885956  107.854950  25.038349
2010-01-11   27.003820  299.432648  106.725700  24.719858
2010-01-12   26.696650  294.137512  107.574692  24.556530
2010-01-13   27.073221  292.448822  107.343887  24.785191
2010-01-14   26.916422  293.823669  109.058350  25.283342
2010-01-15   26.466595  288.917053  108.621490  25.201679
2010-01-19   27.637430  292.712830  110.566757  25.397671
2010-01-20   27.212029  289.121307  107.360382  24.981182
2010-01-21   26.741631  290.401489  106.330040  24.507528
2010-01-22   25.415281  273.978058  103.445122  23.650047
2010-01-25   26.099028  268.991760  103.956169  23.944042
2010-01-26   26.467880  270.197235  103.651207  24.091042
2010-01-27   26.717218  270.037842  104.129272  24.229874
2010-01-28   25.613209  266.147400  102.002670  23.813379
2010-01-29   24.683992  263.980530  100.881660  23.013071
2010-02-01   25.027143  265.514771  102.760971  23.200891
2010-02-02   25.172379  264.568329  103.469849  23.241730
2010-02-03   25.605494  269.400208  103.577019  23.380560
2010-02-04   24.682707  262.406433  101.384453  22.735409
2010-02-05   25.120964  264.653015  101.813095  22.882408
2010-02-08   24.948748  265.738953  100.910622  22.637409
2010-02-09   25.214790  267.218414  102.011803  22.874241
2010-02-10   25.077271  266.227112  101.680611  22.857906
2010-02-11   25.533520  267.198486  102.442314  22.964071
2010-02-12   25.753294  265.564606  102.665886  22.808908
2010-02-16   26.141434  269.639313  103.684265  23.260166
...                ...         ...         ...        ...
2017-07-24  151.495071  980.340027  144.463654  73.209946
2017-07-25  152.142548  950.700012  144.661560  73.796822
2017-07-26  152.859726  947.799988  143.840240  73.657562
2017-07-27  149.971069  934.090027  143.553284  72.772285
2017-07-28  148.915207  941.530029  142.781418  72.652916
2017-07-31  148.148224  930.500000  143.157455  72.314713
2017-08-01  149.463058  930.830017  143.780869  72.195358
2017-08-02  156.525330  930.390015  142.939758  71.877052
2017-08-03  154.961472  923.650024  143.424637  71.767632
2017-08-04  155.778259  927.960022  143.642334  72.294823
2017-08-07  158.188797  929.359985  141.970001  72.016312
2017-08-08  159.453827  926.789978  142.110001  72.404243
2017-08-09  160.429993  922.900024  141.770004  72.085938
2017-08-10  155.320007  907.239990  141.839996  71.031555
2017-08-11  157.479996  914.390015  141.839996  72.115776
2017-08-14  159.850006  922.669983  142.320007  73.199997
2017-08-15  161.600006  922.219971  142.070007  73.220001
2017-08-16  160.949997  926.960022  142.500000  73.650002
2017-08-17  157.860001  910.979980  140.699997  72.400002
2017-08-18  157.500000  910.669983  139.699997  72.489998
2017-08-21  157.210007  906.659973  140.330002  72.150002
2017-08-22  159.779999  924.690002  141.009995  73.160004
2017-08-23  159.979996  927.000000  142.139999  72.720001
2017-08-24  159.270004  921.280029  142.940002  72.690002
2017-08-25  159.860001  915.890015  143.740005  72.820000
2017-08-28  161.470001  913.809998  142.509995  72.830002
2017-08-29  162.910004  921.289978  143.139999  73.050003
2017-08-30  163.350006  929.570007  142.559998  74.010002
2017-08-31  164.000000  939.330017  143.029999  74.769997
2017-09-01  164.050003  937.340027  144.080002  73.940002

[1931 rows x 4 columns]

In [329]:
pdata.loc[:, '6/1/2012', :] # 모든 컬럼 특정 row 값  전체 회사

            Open        High         Low       Close   Adj Close       Volume
AAPL   81.308571   81.807144   80.074287   80.141426   72.099739  130246900.0
GOOG  284.827393  285.255798  283.113831  284.423920  284.423920    6138700.0
IBM   190.119995  191.720001  188.600006  189.080002  162.828171    5206400.0
MSFT   28.760000   28.959999   28.440001   28.450001   24.668653   56634300.0

In [331]:
pdata.loc['Adj Close', '5/22/2012':, :]

                  AAPL        GOOG         IBM       MSFT
Date
2012-05-22   71.583061  299.278229  169.493561  25.804539
2012-05-23   73.329674  303.592072  168.890732  25.240936
2012-05-24   72.656212  300.702881  168.864868  25.206251
2012-05-25   72.266800  294.660553  167.323425  25.197577
2012-05-29   73.549454  296.060303  169.183533  25.631123
2012-05-30   74.436249  293.016693  167.521484  25.440367
2012-05-31   74.251175  289.345459  166.117752  25.310303
2012-06-01   72.099739  284.423920  162.828171  24.668653
2012-06-04   72.523842  288.214691  162.363113  24.755363
2012-06-05   72.336205  284.139984  162.931534  24.720682
2012-06-06   73.445358  289.200989  167.056473  25.449030
2012-06-07   73.478767  288.035370  167.443970  25.344986
2012-06-08   74.584061  289.141235  168.046753  25.709158
2012-06-11   73.408081  283.188538  165.781921  25.058844
2012-06-12   74.049400  281.494873  167.538712  25.397011
2012-06-13   73.535316  279.497375  166.290054  25.258274
2012-06-14   73.454330  278.481171  168.012360  25.440367
2012-06-15   73.788521  281.200989  171.457001  26.029984
2012-06-18   75.285774  284.359161  170.759460  25.873913
2012-06-19   75.495277  289.679199  171.310577  26.619606
2012-06-20   75.280624  287.676727  171.181396  26.819031
2012-06-21   74.243469  281.549683  166.539749  26.134035
2012-06-22   74.812836  284.672974  166.806732  26.619606
2012-06-25   73.356667  279.303101  166.083328  25.899921
2012-06-26   73.518631  281.285675  165.299698  26.029984
2012-06-27   73.836052  283.587036  166.203903  26.160044
2012-06-28   73.135612  281.101349  164.826035  25.934605
2012-06-29   75.057014  288.951935  168.425720  26.524225
2012-07-02   76.152031  289.151184  168.640976  26.498209
2012-07-03   77.037544  292.817444  168.727112  26.671631
...                ...         ...         ...        ...
2017-07-24  151.495071  980.340027  144.463654  73.209946
2017-07-25  152.142548  950.700012  144.661560  73.796822
2017-07-26  152.859726  947.799988  143.840240  73.657562
2017-07-27  149.971069  934.090027  143.553284  72.772285
2017-07-28  148.915207  941.530029  142.781418  72.652916
2017-07-31  148.148224  930.500000  143.157455  72.314713
2017-08-01  149.463058  930.830017  143.780869  72.195358
2017-08-02  156.525330  930.390015  142.939758  71.877052
2017-08-03  154.961472  923.650024  143.424637  71.767632
2017-08-04  155.778259  927.960022  143.642334  72.294823
2017-08-07  158.188797  929.359985  141.970001  72.016312
2017-08-08  159.453827  926.789978  142.110001  72.404243
2017-08-09  160.429993  922.900024  141.770004  72.085938
2017-08-10  155.320007  907.239990  141.839996  71.031555
2017-08-11  157.479996  914.390015  141.839996  72.115776
2017-08-14  159.850006  922.669983  142.320007  73.199997
2017-08-15  161.600006  922.219971  142.070007  73.220001
2017-08-16  160.949997  926.960022  142.500000  73.650002
2017-08-17  157.860001  910.979980  140.699997  72.400002
2017-08-18  157.500000  910.669983  139.699997  72.489998
2017-08-21  157.210007  906.659973  140.330002  72.150002
2017-08-22  159.779999  924.690002  141.009995  73.160004
2017-08-23  159.979996  927.000000  142.139999  72.720001
2017-08-24  159.270004  921.280029  142.940002  72.690002
2017-08-25  159.860001  915.890015  143.740005  72.820000
2017-08-28  161.470001  913.809998  142.509995  72.830002
2017-08-29  162.910004  921.289978  143.139999  73.050003
2017-08-30  163.350006  929.570007  142.559998  74.010002
2017-08-31  164.000000  939.330017  143.029999  74.769997
2017-09-01  164.050003  937.340027  144.080002  73.940002

[1330 rows x 4 columns]

In [332]:
# 3차원 데이터를 frame 으로 (stack) 2차원으로 만듬 
stacked = pdata.loc[:, '5/30/2012':, :].to_frame() 
stacked

                        Open        High         Low       Close   Adj Close  \
Date       minor
2012-05-30 AAPL    81.314285   82.855713   80.937141   82.738571   74.436249
           GOOG   292.981842  294.844849  290.675476  293.016693  293.016693
           IBM    194.800003  195.470001  193.770004  194.529999  167.521484
           MSFT    29.350000   29.480000   29.120001   29.340000   25.440367
2012-05-31 AAPL    82.962860   83.071426   81.637146   82.532860   74.251175
           GOOG   293.260773  293.898407  288.418945  289.345459  289.345459
           IBM    194.100006  194.929993  192.000000  192.899994  166.117752
           MSFT    29.299999   29.420000   28.940001   29.190001   25.310303
2012-06-01 AAPL    81.308571   81.807144   80.074287   80.141426   72.099739
           GOOG   284.827393  285.255798  283.113831  284.423920  284.423920
           IBM    190.119995  191.720001  188.600006  189.080002  162.828171
           MSFT    28.760000   28.959999   28.440001   28.450001   24.668653
2012-06-04 AAPL    80.214287   81.071426   78.357140   80.612854   72.523842
           GOOG   284.045319  289.161163  283.940735  288.214691  288.214691
           IBM    188.339996  189.380005  187.000000  188.539993  162.363113
           MSFT    28.620001   28.780001   28.320000   28.549999   24.755363
2012-06-05 AAPL    80.181427   80.924286   79.761429   80.404289   72.336205
           GOOG   286.650574  287.985565  282.177338  284.139984  284.139984
           IBM    187.919998  189.850006  187.559998  189.199997  162.931534
           MSFT    28.510000   28.750000   28.389999   28.510000   24.720682
2012-06-06 AAPL    81.110001   81.978569   80.785713   81.637146   73.445358
           GOOG   287.163635  289.898376  285.734009  289.200989  289.200989
           IBM    190.779999  194.000000  190.020004  193.990005  167.056473
           MSFT    28.879999   29.370001   28.809999   29.350000   25.449030
2012-06-07 AAPL    82.470001   82.474289   81.500000   81.674286   73.478767
           GOOG   292.702881  292.847351  287.547211  288.035370  288.035370
           IBM    195.279999  195.830002  193.940002  194.440002  167.443970
           MSFT    29.639999   29.700001   29.170000   29.230000   25.344986
2012-06-08 AAPL    81.657143   82.940002   81.285713   82.902855   74.584061
           GOOG   286.849823  289.415192  286.217194  289.141235  289.141235
...                      ...         ...         ...         ...         ...
2017-08-23 IBM    140.699997  143.050003  140.679993  142.139999  142.139999
           MSFT    72.959999   73.150002   72.529999   72.720001   72.720001
2017-08-24 AAPL   160.429993  160.740005  158.550003  159.270004  159.270004
           GOOG   928.659973  930.840027  915.500000  921.280029  921.280029
           IBM    142.500000  143.679993  142.250000  142.940002  142.940002
           MSFT    72.739998   72.860001   72.070000   72.690002   72.690002
2017-08-25 AAPL   159.649994  160.559998  159.270004  159.860001  159.860001
           GOOG   923.489990  925.554993  915.500000  915.890015  915.890015
           IBM    143.300003  144.190002  143.250000  143.740005  143.740005
           MSFT    72.860001   73.349998   72.480003   72.820000   72.820000
2017-08-28 AAPL   160.139999  162.000000  159.929993  161.470001  161.470001
           GOOG   916.000000  919.244995  911.869995  913.809998  913.809998
           IBM    144.110001  144.559998  142.389999  142.509995  142.509995
           MSFT    73.059998   73.089996   72.550003   72.830002   72.830002
2017-08-29 AAPL   160.100006  163.119995  160.000000  162.910004  162.910004
           GOOG   905.099976  923.330017  905.000000  921.289978  921.289978
           IBM    142.100006  143.429993  141.899994  143.139999  143.139999
           MSFT    72.250000   73.160004   72.050003   73.050003   73.050003
2017-08-30 AAPL   163.800003  163.889999  162.610001  163.350006  163.350006
           GOOG   920.049988  930.818970  919.650024  929.570007  929.570007
           IBM    143.259995  143.279999  142.410004  142.559998  142.559998
           MSFT    73.010002   74.209999   72.830002   74.010002   74.010002
2017-08-31 AAPL   163.639999  164.520004  163.479996  164.000000  164.000000
           GOOG   931.760010  941.979980  931.760010  939.330017  939.330017
           IBM    143.020004  143.660004  142.630005  143.029999  143.029999
           MSFT    74.029999   74.959999   73.800003   74.769997   74.769997
2017-09-01 AAPL   164.800003  164.940002  163.630005  164.050003  164.050003
           GOOG   941.130005  942.479980  935.150024  937.340027  937.340027
           IBM    142.979996  144.500000  142.979996  144.080002  144.080002
           MSFT    74.709999   74.739998   73.639999   73.940002   73.940002

                       Volume
Date       minor
2012-05-30 AAPL   132357400.0
           GOOG     3827600.0
           IBM      3602500.0
           MSFT    41585500.0
2012-05-31 AAPL   122918600.0
           GOOG     5958800.0
           IBM      9287500.0
           MSFT    39134000.0
2012-06-01 AAPL   130246900.0
           GOOG     6138700.0
           IBM      5206400.0
           MSFT    56634300.0
2012-06-04 AAPL   139248900.0
           GOOG     4883500.0
           IBM      4624500.0
           MSFT    47926300.0
2012-06-05 AAPL    97053600.0
           GOOG     4697200.0
           IBM      3556500.0
           MSFT    45715400.0
2012-06-06 AAPL   100363900.0
           GOOG     4207200.0
           IBM      3641300.0
           MSFT    46860500.0
2012-06-07 AAPL    94941700.0
           GOOG     3530100.0
           IBM      3701100.0
           MSFT    37792800.0
2012-06-08 AAPL    86879100.0
           GOOG     2831300.0
...                       ...
2017-08-23 IBM      4048300.0
           MSFT    13766500.0
2017-08-24 AAPL    19818900.0
           GOOG     1270300.0
           IBM      3592200.0
           MSFT    17098300.0
2017-08-25 AAPL    25480100.0
           GOOG     1053400.0
           IBM      2872900.0
           MSFT    12794300.0
2017-08-28 AAPL    25966000.0
           GOOG     1086500.0
           IBM      5134500.0
           MSFT    14569700.0
2017-08-29 AAPL    29516900.0
           GOOG     1185600.0
           IBM      3009500.0
           MSFT    11478400.0
2017-08-30 AAPL    27269600.0
           GOOG     1301200.0
           IBM      2736000.0
           MSFT    16897800.0
2017-08-31 AAPL    26785100.0
           GOOG     1582600.0
           IBM      3656400.0
           MSFT    27652800.0
2017-09-01 AAPL    16552800.0
           GOOG      915900.0
           IBM      3348500.0
           MSFT    21706200.0

[5300 rows x 6 columns]

In [333]:
stacked.to_panel()

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  """Entry point for launching an IPython kernel.

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1325 (major_axis) x 4 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2012-05-30 00:00:00 to 2017-09-01 00:00:00
Minor_axis axis: AAPL to MSFT